Тестовая_база_ERP_14/src/Documents/РЭЙ_ЗаявлениеВБанкПС/РЭЙ_ЗаявлениеВБанкПС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РЭЙ_ЗаявлениеВБанкПС</name>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>БанкНовый</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИногоОснованияЗакрытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.РЭЙ_ВидыОперацийЗаявлениеВБанк</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияПС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереоформленияПС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияПС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзменениеСуммыКонтракта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактВЭД</name>
    <type>
      <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактДатаОкончанияНовая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактСуммаНовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеЗакрытияПС</name>
    <comment>Номер подпункта Инструкции ЦБ РФ от 16.08.2017 №181-И</comment>
    <type>
      <types>EnumRef.РЭЙ_ОснованияЗакрытияПС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПереоформленияПС</name>
    <comment>Номер подпункта Инструкции ЦБ РФ от 16.08.2017 №181-И</comment>
    <type>
      <types>EnumRef.РЭЙ_ОснованияПереоформленияПС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродлениеСрокаКонтракта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктИнструкцииЦБР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонУполномоченногоПС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УполномоченныйПС</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияДоговор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияИнойДокументДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияИнойДокументНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПаспортаСделок</name>
    <attributes>
      <name>ПаспортСделки</name>
      <type>
        <types>DocumentRef.РЭЙ_ПаспортСделки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыИныеОснования</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзменениеКодовВидовОпераций</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодВОБанка</name>
      <type>
        <types>CatalogRef.РЭЙ_ВидыВалютныхОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>КодВООрганизации</name>
      <type>
        <types>CatalogRef.РЭЙ_ВидыВалютныхОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетныйДокумент</name>
      <type>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/Enums/РЭЙ_ВидыОперацийЗаявлениеВБанк/РЭЙ_ВидыОперацийЗаявлениеВБанк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РЭЙ_ВидыОперацийЗаявлениеВБанк</name>
  <enumValues>
    <name>ЗакрытиеПаспортаСделки</name>
  </enumValues>
  <enumValues>
    <name>ПереоформлениеПаспортаСделки</name>
  </enumValues>
  <enumValues>
    <name>ПредоставлениеВедомостиБанковскогоКонтроля</name>
  </enumValues>
  <enumValues>
    <name>пункт181_7_1_ВнесениеИзмененийВРаздел1ВБК</name>
    <comment>п.6.9, п.7.1, п.7.9 Инструкции от 16.08.2017 №181-И</comment>
  </enumValues>
  <enumValues>
    <name>пункт181_2_25_ИзменениеКодовВидовОпераций</name>
    <comment>п.2.25 Инструкции от 16.08.2017 №181-И</comment>
  </enumValues>
  <enumValues>
    <name>пункт181_17_4_ПредоставлениеВБК</name>
    <comment>п.17.4 Инструкции от 16.08.2017 №181-И</comment>
  </enumValues>
  <enumValues>
    <name>пункт181_6_1_СнятиеСУчетаКонтракта</name>
    <comment>п/п.6.1.1-6.1.6 Инструкции от 16.08.2017 №181-И</comment>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Documents/РЭЙ_ЗаявлениеВБанкПС/Forms/ФормаВыбораОперации/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	Если Параметры.Свойство("ИзменитьВидОперации") Тогда
		ИзменитьВидОперации = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	
	СтрокаТаблицы = Элементы.СписокВидовОпераций.ТекущиеДанные;
	
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		
		ОткрытьДокументВида(СтрокаТаблицы.Значение);
		
	КонецЕсли; 
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЗначениеКопирования = Параметры.ЗначениеКопирования;
	ЗначенияЗаполнения = Параметры.ЗначенияЗаполнения;
	Основание = Параметры.Основание;
	
	Параметры.ЗначениеКопирования	= Неопределено;
	Параметры.ЗначенияЗаполнения	= Неопределено;
	Параметры.Основание				= Неопределено;
	
	//ФормыДокумента   = Новый ФиксированноеСоответствие(
	//	Документы.РеализацияТоваровУслуг.ПолучитьСоответствиеВидовОперацийФормам());
		
	ВидыОпераций = ПолучитьСписокВидовОпераций();
	Для Каждого ВидОперации Из ВидыОпераций Цикл
		НоваяОперация = СписокВидовОпераций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяОперация, ВидОперации);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		ВыделенныйЭлементСписка = СписокВидовОпераций.НайтиПоЗначению(Объект.ВидОперации);
		Если ВыделенныйЭлементСписка <> Неопределено Тогда
			Элементы.СписокВидовОпераций.ТекущаяСтрока = ВыделенныйЭлементСписка.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокВидовОпераций()
	СписокВидовОпераций = Новый СписокЗначений;
	
	СписокВидовОпераций.Добавить(Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.пункт181_7_1_ВнесениеИзмененийВРаздел1ВБК, Метаданные.Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.ЗначенияПеречисления.пункт181_7_1_ВнесениеИзмененийВРаздел1ВБК.Синоним);
	СписокВидовОпераций.Добавить(Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.пункт181_2_25_ИзменениеКодовВидовОпераций, Метаданные.Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.ЗначенияПеречисления.пункт181_2_25_ИзменениеКодовВидовОпераций.Синоним);
	СписокВидовОпераций.Добавить(Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.пункт181_17_4_ПредоставлениеВБК, Метаданные.Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.ЗначенияПеречисления.пункт181_17_4_ПредоставлениеВБК.Синоним);
	СписокВидовОпераций.Добавить(Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.пункт181_6_1_СнятиеСУчетаКонтракта, Метаданные.Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.ЗначенияПеречисления.пункт181_6_1_СнятиеСУчетаКонтракта.Синоним);
	
	Возврат СписокВидовОпераций;
КонецФункции

&НаКлиенте
Процедура СписокВидовОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТаблицы = СписокВидовОпераций.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ОткрытьДокументВида(СтрокаТаблицы.Значение);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументВида(ВыбранныйВидОперации)
	
	ЗначенияЗаполнения.Вставить("ВидОперации",			ВыбранныйВидОперации);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ключ",                Параметры.Ключ);
	СтруктураПараметров.Вставить("ЗначениеКопирования", ЗначениеКопирования);
	СтруктураПараметров.Вставить("ЗначенияЗаполнения",  ЗначенияЗаполнения);
	СтруктураПараметров.Вставить("Основание",           Основание);
	Если ИзменитьВидОперации И ВыбранныйВидОперации <> Объект.ВидОперации Тогда
		СтруктураПараметров.Вставить("ИзменитьВидОперации", ИзменитьВидОперации);
	КонецЕсли;
	
	Модифицированность = Ложь;
	Закрыть();
	
	ОткрытьФорму("Документ.РЭЙ_ЗаявлениеВБанкПС.Форма.ФормаДокумента", СтруктураПараметров, ВладелецФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не Параметры.Ключ.Пустая() Тогда 
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Ключ",   Параметры.Ключ);
		
		ОткрытьФорму("Документ.РЭЙ_ЗаявлениеВБанкПС.Форма.ФормаДокумента", СтруктураПараметров, ВладелецФормы);
		
		Отказ = Истина;
		
	КонецЕсли;	
	
	Если ЗначенияЗаполнения.Количество() > 0 Тогда 
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ЗначенияЗаполнения",   ЗначенияЗаполнения);
		
		ОткрытьФорму("Документ.РЭЙ_ЗаявлениеВБанкПС.Форма.ФормаДокумента", СтруктураПараметров, ВладелецФормы);
		
		Отказ = Истина;

	КонецЕсли;	
	
КонецПроцедуры
